<a href="https://colab.research.google.com/github/19PA1A0493/PYTHON-BASICS/blob/master/multivariate.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd # for handling data in the form of tables
import numpy as np # For handling matrix
from sklearn.model_selection import train_test_split 
from sklearn.linear_model import LinearRegression # for using the model
import matplotlib.pyplot as plt

In [9]:
hd=pd.read_csv("house_data.csv")

hd.head()

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (1) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

   id             date     price  ...  Unnamed: 18  Unnamed: 19  Unnamed: 20
0  id  20141013T000000  221900.0  ...          NaN          NaN          NaN
1  id  20141209T000000  538000.0  ...          NaN          NaN          NaN
2  id  20150225T000000  180000.0  ...          NaN          NaN          NaN
3  id  20141209T000000  604000.0  ...          NaN          NaN          NaN
4  id  20150218T000000  510000.0  ...          NaN          NaN          NaN

[5 rows x 21 columns]

In [0]:
hd=hd.drop(['Unnamed: 6','Unnamed: 7','Unnamed: 8','Unnamed: 9','Unnamed: 10','Unnamed: 11','Unnamed: 12','Unnamed: 13','Unnamed: 14','Unnamed: 15','Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20'
],axis=1,inplace=False)

In [17]:
hd

        id             date     price  bedrooms  bathrooms  sqft_living
0       id  20141013T000000  221900.0       3.0       1.00       1180.0
1       id  20141209T000000  538000.0       3.0       2.25       2570.0
2       id  20150225T000000  180000.0       2.0       1.00        770.0
3       id  20141209T000000  604000.0       4.0       3.00       1960.0
4       id  20150218T000000  510000.0       3.0       2.00       1680.0
...     ..              ...       ...       ...        ...          ...
192524  id              NaN       NaN       NaN        NaN          NaN
192525  id              NaN       NaN       NaN        NaN          NaN
192526  id              NaN       NaN       NaN        NaN          NaN
192527  id              NaN       NaN       NaN        NaN          NaN
192528  id              NaN       NaN       NaN        NaN          NaN

[192529 rows x 6 columns]

In [18]:
hd.isna().any()

id             False
date            True
price           True
bedrooms        True
bathrooms       True
sqft_living     True
dtype: bool

In [40]:
hd=hd.fillna(method="ffill")
hd

           price  bedrooms  bathrooms  sqft_living
0       221900.0       3.0       1.00       1180.0
1       538000.0       3.0       2.25       2570.0
2       180000.0       2.0       1.00        770.0
3       604000.0       4.0       3.00       1960.0
4       510000.0       3.0       2.00       1680.0
...          ...       ...        ...          ...
192524  325000.0       2.0       0.75       1020.0
192525  325000.0       2.0       0.75       1020.0
192526  325000.0       2.0       0.75       1020.0
192527  325000.0       2.0       0.75       1020.0
192528  325000.0       2.0       0.75       1020.0

[192529 rows x 4 columns]

In [0]:
hd=hd.drop(['id','date'],axis=1,inplace=False)

In [44]:
hd

           price  bedrooms  bathrooms  sqft_living
0       221900.0       3.0       1.00       1180.0
1       538000.0       3.0       2.25       2570.0
2       180000.0       2.0       1.00        770.0
3       604000.0       4.0       3.00       1960.0
4       510000.0       3.0       2.00       1680.0
...          ...       ...        ...          ...
192524  325000.0       2.0       0.75       1020.0
192525  325000.0       2.0       0.75       1020.0
192526  325000.0       2.0       0.75       1020.0
192527  325000.0       2.0       0.75       1020.0
192528  325000.0       2.0       0.75       1020.0

[192529 rows x 4 columns]

In [0]:
X=hd[['bedrooms','bathrooms','sqft_living']].values
y=hd['price'].values

In [51]:
X.shape

(192529, 3)

In [55]:
y.shape

(192529,)

In [0]:
X_train,X_test,y_train,y_test= train_test_split(X, y, test_size=0.2, random_state=0)

In [57]:
model = LinearRegression()  
model.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [59]:
model.intercept_

144935.12472624367

In [60]:
model.coef_

array([-63414.72982559, -10833.78084966,    307.76837927])

In [61]:
predicted_price=model.predict(X_test)
predicted_price.shape

(38506,)

In [62]:
X_test.shape

(38506, 3)

In [0]:
Actual_predicted=pd.DataFrame({"Actual": y_test.flatten(), "Predicted": predicted_price.flatten()})

In [64]:
Actual_predicted.head()

     Actual      Predicted
0  510000.0  650492.935821
1  325000.0  323904.076290
2  325000.0  323904.076290
3  325000.0  323904.076290
4  325000.0  323904.076290

In [0]:
from sklearn import metrics as mt

In [66]:
mt.r2_score(y_test,predicted_price)

0.6283563766131772